eisup_2019_docmng_integration/src/Catalogs/ХранилищеДополнительнойИнформации/ХранилищеДополнительнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранилищеДополнительнойИнформации</name>
  <comment>Хранилище дополнительной информации</comment>
  <attributes>
    <name>ВидДанных</name>
    <comment>Вид данных</comment>
    <type>
      <types>EnumRef.ВидыДополнительнойИнформацииОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <comment>Имя файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <comment>Объект</comment>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам</types>
      <types>CatalogRef.СерииНоменклатуры</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.абс_ЗадачаВТехподдержку</types>
      <types>CatalogRef.Территории</types>
      <types>DocumentRef.ВнутреннееПеремещениеСредствПриБюджетировании</types>
      <types>DocumentRef.абс_ЗадачаТЭО</types>
      <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
      <types>DocumentRef.абс_ПоступлениеУниверсальныйСклад</types>
      <types>DocumentRef.абс_РазукрупнениеОС</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>DocumentRef.ТребованиеНакладная</types>
      <types>CatalogRef.абс_ТЭО</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>DocumentRef.абс_РаспределяемыеДоходыРасходы</types>
      <types>DocumentRef.абс_ПеремещениеУниверсальныйСклад</types>
      <types>CatalogRef.ЗаявкиКандидатов</types>
      <types>DocumentRef.абс_РезервыПроизведенныхРасходов</types>
      <types>CatalogRef.ОсновныеСредства</types>
      <types>DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</types>
      <types>DocumentRef.абс_НеотфактурованнаяПоставка</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ПередачаТоваров</types>
      <types>DocumentRef.абс_РаспоряжениеНаЗакупку</types>
      <types>DocumentRef.абс_ИзменениеКонтрагентаВДоговоре</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.абс_ПлановыеРегламентныеРаботы</types>
      <types>DocumentRef.ПеремещениеМатериаловВЭксплуатации</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>CatalogRef.Помещения</types>
      <types>DocumentRef.ttk_РаспоряжениеНаЗакупку</types>
      <types>DocumentRef.МодернизацияОС</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.СписаниеМатериаловИзЭксплуатации</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
      <types>DocumentRef.ВозвратПереданныхТоваров</types>
      <types>DocumentRef.ПередачаМатериаловВЭксплуатацию</types>
      <types>DocumentRef.абс_ЗакупочныйЗаказ</types>
      <types>DocumentRef.абс_ЧастичнаяЛиквидацияОС</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.абс_РеклассификацияБюджета</types>
      <types>DocumentRef.КорректировкаПоступления</types>
      <types>DocumentRef.СписаниеОС</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>CatalogRef.Контрагенты</types>
      <types>DocumentRef.ttk_ПроектКорректировкиДога</types>
      <types>CatalogRef.РасходыБудущихПериодов</types>
      <types>DocumentRef.абс_ЗаявкаНаДобавлениеИзменениеПрав</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>CatalogRef.Организации</types>
      <types>DocumentRef.абс_ГрупповаяРеклассификацияБюджета</types>
      <types>DocumentRef.абс_ВводЗначенийПоказателейДляРасчетаКПЭ</types>
      <types>DocumentRef.Событие</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>CatalogRef.КомпетенцииРаботников</types>
      <types>DocumentRef.абс_ПереносДанных</types>
      <types>DocumentRef.абс_СчетНаОплату</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.ЭлектронноеПисьмо</types>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
      <types>CatalogRef.Вакансии</types>
      <types>DocumentRef.абс_АВИЗО</types>
      <types>CatalogRef.абс_ИнструкцииПользователя</types>
      <types>DocumentRef.Абс_АктПриёмкиВыполненныхРабот</types>
      <types>BusinessProcessRef.абсЗаявкаВПоддержку</types>
      <types>CatalogRef.Номенклатура</types>
      <types>DocumentRef.абс_ВыбытиеУниверсальныйСклад</types>
      <types>DocumentRef.ПеремещениеОС</types>
      <types>DocumentRef.КомплектацияНоменклатуры</types>
      <types>DocumentRef.АктСверкиВзаиморасчетов</types>
      <types>DocumentRef.абс_ЗаявкаНаПроект</types>
      <types>DocumentRef.ПланируемоеПоступлениеДенежныхСредств</types>
      <types>DocumentRef.абс_ВводБюджета</types>
      <types>DocumentRef.БюджетнаяОперация</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.СписаниеТоваров</types>
      <types>DocumentRef.ПолучениеУслугПоПереработке</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <comment>Хранилище</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаПрикрепленияФайла</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИтоговыйФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИнициаторФайла</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КлючСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЭтоСчетСканСчетаНаОплату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЗагруженИзИСУЗК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СвойствоОС</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.абс_СвойстваОС</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипДокумента</name>
    <type>
      <types>CatalogRef.абс_ТипыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ttk_ХэшФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ttk_СсылкаНаАналогичныйФайл</name>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/ХранилищеДополнительнойИнформации/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВидДанных	= Перечисления.ВидыДополнительнойИнформацииОбъектов.Файл;
	Объект 		= ДанныеЗаполнения.Объект;
	
КонецПроцедуры
	
Процедура ПередЗаписью(Отказ)
	
	Если ПометкаУдаления И НЕ Ссылка.ПометкаУдаления Тогда
		Если НЕ РольДоступна("ПолныеПрава") Тогда
		    РазрешеноУдалитьФайл = Ложь;
			
			мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(глЗначениеПеременной("глТекущийПользователь"),
				?(Объект.Метаданные().Реквизиты.Найти("Организация") <> Неопределено, Объект.Организация, Неопределено));
			Если мРолиПользователя.Найти(Справочники.РолиИсполнителей.ПравоУстановкиПометкиУдаленияВложений) <> Неопределено Тогда
				РазрешеноУдалитьФайл = Истина;
			КонецЕсли;		
			//// Проверим статус объекта файла.
			//ТипОбъекта = ТипЗнч(Объект);
			//РазрешеноУдалитьФайл = Ложь;			
			//Если ТипОбъекта = Тип("ДокументСсылка.абс_ЗакупочныйЗаказ") Тогда				
			//	мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(глЗначениеПеременной("глТекущийПользователь"), Объект.Организация);
			//	Если Объект.Статус = Перечисления.абсСтатусЗакупочногоЗаказа.Подготовка И мРолиПользователя.Найти(Справочники.РолиИсполнителей.ПравоУстановкиПометкиУдаленияВложений) <> Неопределено Тогда
			//		РазрешеноУдалитьФайл = Истина;
			//	КонецЕсли;							
			//ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.абс_СчетНаОплату") Тогда
			//	мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(глЗначениеПеременной("глТекущийПользователь"), Объект.Организация);
			//	Если Объект.СтатусСчета = Перечисления.абсСтатусыСчетов.Подготовка Тогда
			//		РазрешеноУдалитьФайл = Истина;
			//	КонецЕсли;				
			//ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Контрагенты") Тогда
			//	мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(глЗначениеПеременной("глТекущийПользователь"));
			//	Если Объект.абс_СтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.Подготовка Тогда
			//		РазрешеноУдалитьФайл = Истина;
			//	КонецЕсли;				
			//ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			//	мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(глЗначениеПеременной("глТекущийПользователь"), Объект.Организация);
			//	Если Объект.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.Подготовка Тогда
			//		РазрешеноУдалитьФайл = Истина;
			//	КонецЕсли;				
			//Иначе				
			//	РазрешеноУдалитьФайл = Истина;				
			//КонецЕсли;			
			
			Если НЕ РазрешеноУдалитьФайл Тогда
				ttk_ОбщегоНазначения.СообщитьОбОшибке("Запрещено удалять файлы!", Отказ);
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		абс_ИнициаторФайла = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
	//SLADKOV 14 07 2017 ++
	Если Не ЗначениеЗаполнено(абс_ИнициаторФайла) Тогда		
		Отказ = Истина;
		Сообщить("Не заполнен инициатор файла");		
	КонецЕсли;	
		
	Если НЕ ЗначениеЗаполнено(абс_ДатаПрикрепленияФайла)  Тогда
		Отказ = Истина;
		Сообщить("Не заполнена Дата файла");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИмяФайла) Тогда		
		Отказ = Истина;
		Сообщить("Не заполнено Имя Файла");		
	КонецЕсли;	
	//SLADKOV 14 07 2017 --
	
КонецПроцедуры

//sladkov 13 01 2017 ++
Процедура ПередУдалением(Отказ)
	
	//Перед удалением необходимо проверить есть ли ссылки на данный объект из других элементов справочника
	
	//Проверка выполняеться в любом случае, даже при обмене данными, иначе можно удалить нужные файлы
	
	ЗапросПроверкаСсылок = новый ЗАпрос;
	
	ЗапросПроверкаСсылок.Текст = "ВЫБРАТЬ
	                             |	ХранилищеДополнительнойИнформации.Ссылка,
	                             |	ХранилищеДополнительнойИнформации.Объект
	                             |ИЗ
	                             |	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	                             |ГДЕ
	                             |	ХранилищеДополнительнойИнформации.ttk_СсылкаНаАналогичныйФайл = &ТекущийФайл";

	ЗапросПроверкаСсылок.УстановитьПараметр("ТекущийФайл",Ссылка);
				
	ВыборкаПроверка = ЗапросПроверкаСсылок.Выполнить().Выбрать();
	
	Если ВыборкаПроверка.Следующий() Тогда
		
		Сообщить("Есть ссылки на объект: "+ ВыборкаПроверка.Ссылка+" Документ:" +ВыборкаПроверка.Объект+ " удаление элемента запрещено!");

		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
//sladkov 13 01 2017 --
